# Add all Taps
tap "aws/tap"
tap "chrokh/tap"
tap "garden-io/garden"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "versent/taps"
tap "weaveworks/tap"
tap "stripe/stripe-cli"
tap "codefresh-io/cli"
tap "nextdns/tap"
tap "th-ch/youtube-music"

# Install the packages
brew "openssl@1.1"
brew "gdbm"
brew "readline"
brew "automake"
brew "bison"
brew "certbot"
brew "ctags"
brew "bash-completion"
brew "wxwidgets"
brew "fd"
brew "fzf"
brew "gcc"
brew "libffi"
brew "gnupg"
brew "gpgme"
brew "hey"
brew "htop"
brew "jq"
brew "libyaml"
brew "marp-cli" # markdown presentation rendering
brew "pkg-config"
brew "redis"
brew "ripgrep"
brew "telnet"
brew "the_silver_searcher"
brew "tree"
brew "wget"
brew "zsh"
brew "speedtest-cli"
brew "stripe/stripe-cli/stripe"
brew "localstack"
brew "awscli-local"
brew "starship" # terminal bar
brew "prettier"
brew "nextdns"
brew "rsync"
brew "neofetch" # utility to print your terminal and computer config
brew "pngpaste"
brew "lazygit"

# neovim and deps
#brew "neovim", args: ["HEAD"]
brew "neovim"
brew "lua"
brew "luarocks"
brew "shellharden"
brew "shellcheck"
brew "shfmt"
brew "stylua"

# git
brew "git"
brew "git-delta"
brew "git-secrets"
brew "gh"
brew "hub"

# a replacement for `ls`
brew "eza"

# install applications from the app store
brew "mas"

# aws tools
brew "aws-iam-authenticator"
brew "awscli"
brew "aws/tap/copilot-cli"

# Manage multiple runtime versions with a single CLI tool
brew "asdf"

# terraform (installed with asdf)
brew "terraform-ls"

# Casks UI apps
# cask "docker" - orbstack is supposed to install the docker binaries
cask "dropbox"
cask "dropbox-capture"
cask "keybase"
cask "postman"
cask "insomnia" # like Postman for APIs
cask "vlc"
cask "zoom"
cask "rectangle"
cask "maccy" # clipboard manager
cask "obsidian" # notes app
cask "notion"
cask "notion-calendar"
cask "youtube-music"
cask "spotify"
cask "calibre"
cask "ghostty" # terminal
cask "warp" # AI terminal
cask "orbstack" # docker manager
cask "livebook" # elixir livebook
cask "android-platform-tools"

# AI tools
cask "lm-studio"
cask "anythingllm"
cask "claude"
cask "chatgpt"

# Editors
cask "windsurf"
cask "cursor"
cask "zed"

# Fonts
cask "font-anonymice-nerd-font"
cask "font-droid-sans-mono-nerd-font"
cask "font-fantasque-sans-mono-nerd-font"
cask "font-caskaydia-cove-nerd-font"
cask "font-agave-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-meslo-lg-nerd-font"
