# Add all Taps
tap "aws/tap"
tap "chrokh/tap"
tap "garden-io/garden"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "versent/taps"
tap "weaveworks/tap"
tap "stripe/stripe-cli"
tap "codefresh-io/cli"

# Install the packages
brew "openssl@1.1"
brew "gdbm"
brew "readline"
brew "asciinema"
brew "automake"
brew "bison"
brew "certbot"
brew "ctags"
brew "wxwidgets"
brew "fd"
brew "fzf"
brew "gcc"
brew "libffi"
brew "gnupg"
brew "gpgme"
brew "hey"
brew "htop"
brew "hugo"
brew "jq"
brew "libyaml"
brew "marp-cli" # markdown presentation rendering
brew "netlify-cli"
brew "pkg-config"
brew "redis"
brew "ripgrep"
brew "telnet"
brew "the_silver_searcher"
brew "tree"
brew "wget"
brew "zsh"
brew "chrokh/tap/base16-manager"
brew "antibody"
brew "speedtest-cli"
brew "stripe/stripe-cli/stripe"
brew "codefresh-io/cli/codefresh"
brew "protobuf" # to compile gRPC

# neovim and deps
#brew "neovim", args: ["HEAD"]
brew "neovim"
brew "lua"
brew "luarocks"
brew "shellharden"
brew "shellcheck"
brew "shfmt"
brew "stylua"

# git
brew "git"
brew "git-delta"
brew "git-secrets"
brew "gh"
brew "hub"

# a replacement for `ls`
brew "exa"

# install applications from the app store
brew "mas"

# aws tools
brew "aws-iam-authenticator"
brew "awscli"
brew "versent/taps/saml2aws"
brew "aws/tap/copilot-cli"
## to model DynamoDB
cask "nosql-workbench-for-amazon-dynamodb"

# kubernetes tools
brew "k9s"
brew "krew"
brew "kubectx"
brew "weaveworks/tap/eksctl"
brew "garden-io/garden/garden-cli"
cask "lens"

# pair in the terminal
brew "tmate"

# replace SSH
brew "mosh"

# Manage multiple runtime versions with a single CLI tool
brew "asdf"

# terraform (installed with asdf)
brew "terraform-ls"

# Casks UI apps
cask "docker"
cask "dropbox"
cask "google-backup-and-sync"
cask "keybase"
cask "ngrok"
cask "postman"
cask "skype"
cask "spotify"
cask "visual-studio-code"
cask "virtualbox"
cask "vlc"
cask "zoom"
cask "rectangle"
cask "maccy" # clipboard manager
cask "kitty" # terminal
cask "iterm2" # terminal
cask "obsidian" # notes app
cask "insomnia" # like Postman for APIs
cask "raycast" # replaces Spotlight

# Fonts
cask "font-anonymice-nerd-font"
cask "font-droid-sans-mono-nerd-font"
cask "font-fantasque-sans-mono-nerd-font"
cask "font-caskaydia-cove-nerd-font"
cask "font-agave-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-inconsolata-nerd-font"
