# Add all Taps
tap "aws/tap"
tap "homebrew/bundle"
tap "stripe/stripe-cli"
tap "nextdns/tap"
tap "th-ch/youtube-music"
tap "sst/tap"
tap "oven-sh/bun"
tap "satococoa/tap"

# Core utilities
brew "stow"              # symlink manager for dotfiles
brew "openssl@1.1"
brew "gdbm"
brew "readline"
brew "automake"
brew "bison"
brew "bash-completion"
brew "libffi"
brew "gnupg"
brew "gpgme"
brew "jq"
brew "tree"
brew "wget"
brew "zsh"
brew "rsync"
brew "telnet"

# Search and file tools
brew "fd"
brew "fzf"
brew "ripgrep"
brew "the_silver_searcher"
brew "ctags"
brew "tree-sitter"
brew "ast-grep"

# Monitoring and system
brew "htop"
brew "neofetch"
brew "blueutil"
brew "speedtest-cli"

# Dev tools
brew "hey"
brew "prettier"
brew "marp-cli"
brew "mermaid-cli"
brew "pngpaste"
brew "lazygit"
brew "jj"                # jujutsu vcs
brew "act"               # run github actions locally
brew "actionlint"        # github actions linter

# Media
brew "imagemagick"
brew "ghostscript"
brew "mpv"
brew "wxwidgets"

# Services
brew "redis"
brew "certbot"
brew "nextdns"
brew "stripe/stripe-cli/stripe"
brew "awscli-local"

# AI tools (CLI)
brew "ollama"
brew "aider"
brew "whisper-cpp"

# Build tools
brew "oven-sh/bun/bun"
brew "uv"                # python package manager
brew "tectonic"          # latex
brew "utftex"

# Terminal prompt
brew "starship"

# Misc
brew "gawk"
brew "mbedtls"
brew "satococoa/tap/wtp"
brew "flyctl"            # fly.io CLI
brew "container"

# Note: Languages (python, node, ruby, elixir, erlang, go) managed via asdf
# See ~/.tool-versions for versions
# elixir-ls: install via `mix escript.install hex elixir_ls`

# neovim and deps
#brew "neovim", args: ["HEAD"]
brew "neovim"
brew "lua"
brew "luarocks"
brew "shellharden"
brew "shellcheck"
brew "shfmt"
brew "stylua"

# git
brew "git"
brew "git-delta"
brew "git-secrets"
brew "gh"
brew "hub"

# a replacement for `ls`
brew "eza"

# install applications from the app store
brew "mas"

# aws tools
brew "aws-iam-authenticator"
brew "awscli"

# Manage multiple runtime versions with a single CLI tool
brew "mise"

# terraform (installed with asdf)
brew "terraform-ls"

# Casks - Productivity
cask "dropbox"
cask "dropbox-capture"
cask "google-drive"
cask "notion"
cask "notion-calendar"
cask "obsidian"
cask "maccy"             # clipboard manager
cask "rectangle"         # window manager

# Casks - Communication
cask "zoom"

# Casks - Browsers
cask "google-chrome"

# Casks - Media
cask "vlc"
cask "spotify"
cask "youtube-music"
cask "calibre"

# Casks - Development
cask "ghostty"           # terminal
cask "warp"              # terminal
cask "orbstack"          # docker manager
cask "livebook"          # elixir livebook
cask "postman"
cask "insomnia"
cask "android-platform-tools"
cask "keybase"
cask "qbittorrent"
cask "balenaetcher"
cask "figma"

# Casks - Security
cask "bitwarden"
brew "bitwarden-cli"
cask "1password"
cask "yubico-yubikey-manager"

# Casks - AI tools
cask "lm-studio"
cask "anythingllm"
cask "claude"
cask "chatgpt"
cask "cursor"
cask "windsurf"
cask "antigravity"
cask "buzz"              # audio transcription
brew "sst/tap/opencode"
brew "gemini-cli"

# Casks - Editors
cask "zed"
cask "visual-studio-code"

# Fonts
cask "font-anonymice-nerd-font"
cask "font-droid-sans-mono-nerd-font"
cask "font-fantasque-sans-mono-nerd-font"
cask "font-caskaydia-cove-nerd-font"
cask "font-agave-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-meslo-lg-nerd-font"
